stress_testing/get-productID.yml
config:
  target: "http://127.0.0.1:3000"
  http:
    pool: 2000
  phases:
    - duration: 20
      arrivalRate: 10
      name: increase (10 per sec)
    - duration: 20
      arrivalRate: 100
      name: heavy (100 per sec)
    - duration: 20
      arrivalRate: 1000
      name: extreme (1000 per sec)
    - duration: 20
      arrivalRate: 1200
      name: extreme (1200 per sec)


scenarios:
  - name: 'Get product ID'
    flow:
      - get:
          url: '/products/{{ $randomNumber (1, 1000000)}}'